casosBasicos/tsungServerAndDatabase/tsung/files/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client maxusers="5000" host="localhost" use_controller_vm="true"/>
  </clients>
  
  <!-- Server side setup -->
  <servers>
    <server host="server" port="80" type="tcp"></server>
  </servers>

  <load duration="10" unit="minute">
   <arrivalphase phase="1" duration="10" unit="minute">
     <users arrivalrate="100" unit="second"></users>
   </arrivalphase>
  </load>

 <sessions>
  <session name="http-example" probability="100" type="ts_http">

    <for from="1" to="1000" incr="1" var="counter">
      <request>
        <http url="/" method="POST" version="1.1" contents="value=123123"></http>
      </request>
    </for>
    
  </session>
 </sessions>
</tsung>